7767517
153 193
Input                    image                    0 1 image -23330=4,3,640,640,3 0=640 1=640 2=3 -23323=1,1 -23333=1,1 -23331=2,127.534065,0.0 54=1
ImageProcess             image_preprocess         1 1 image image_preprocess -23301=3,0.000000,0.000000,0.000000 -23302=3,255.030476,255.030476,255.030476  -23323=1,1  -23331=2,127.534065,0.0  -23330=4,3,640,640,3
Convolution              Conv.0                   1 1 image_preprocess swish_0.tmp_0 -23330=4,3,320,320,16 0=16 1=3 3=2 4=1 5=1 6=576 9=8 24=22 28=16390 41=29 38=1 46=-56 47=18651 48=13 -23323=1,1 -23333=1,1 -23331=2,9.307916,0.0 54=1
Convolution              Conv.1                   1 1 swish_0.tmp_0 swish_1.tmp_0 -23330=4,3,320,320,16 0=16 1=3 4=1 5=1 6=2304 9=8 24=22 28=21144 41=28 46=-8 47=32640 48=11 -23323=1,1 -23333=1,1 -23331=2,3.384176,0.0 54=1
Convolution              Conv.2                   1 1 swish_1.tmp_0 swish_2.tmp_0 -23330=4,3,320,320,32 0=32 1=3 4=1 5=1 6=4608 9=8 24=22 28=17180 41=29 46=-6 47=21760 48=10 -23323=1,1 -23333=1,1 -23331=2,1.057159,0.0 54=1
Convolution              Conv.3                   1 1 swish_2.tmp_0 swish_3.tmp_0 -23330=4,3,160,160,48 0=48 1=3 3=2 4=1 5=1 6=13824 9=8 24=22 28=24225 41=29 46=-20 47=26112 48=12 -23323=1,1 -23333=1,1 -23331=2,5.018930,0.0 54=1
Split                    splitncnn_0              1 2 swish_3.tmp_0 swish_3.tmp_0_splitncnn_0 swish_3.tmp_0_splitncnn_1 -23330=8,3,160,160,48,3,160,160,48 -23323=1,1 -23333=1,1 -23331=4,5.018930,0.0,5.018930,0.0 54=1
Convolution              Conv.4                   1 1 swish_3.tmp_0_splitncnn_0 swish_4.tmp_0 -23330=4,3,160,160,24 0=24 1=1 5=1 6=1152 9=8 24=22 28=26301 41=28 46=-11 47=23738 48=11 -23323=1,1 -23333=1,1 -23331=2,5.733347,0.0 54=1
Convolution              Conv.5                   1 1 swish_3.tmp_0_splitncnn_1 swish_5.tmp_0 -23330=4,3,160,160,24 0=24 1=1 5=1 6=1152 9=8 24=21 28=30221 41=28 46=-56 47=18651 48=13 -23323=1,1 -23333=1,1 -23331=2,34.278347,0.0 54=1
Split                    splitncnn_1              1 2 swish_5.tmp_0 swish_5.tmp_0_splitncnn_0 swish_5.tmp_0_splitncnn_1 -23330=8,3,160,160,24,3,160,160,24 -23323=1,1 -23333=1,1 -23331=4,34.278347,0.0,34.278347,0.0 54=1
Convolution              Conv.6                   1 1 swish_5.tmp_0_splitncnn_1 swish_6.tmp_0 -23330=4,3,160,160,24 0=24 1=3 4=1 5=1 6=5184 9=8 24=23 28=25097 41=28 36=1 46=-35 47=29842 48=13 -23323=1,1 -23333=1,1 -23331=2,18.124189,0.0 54=1
Convolution              Conv.7                   2 1 swish_6.tmp_0 swish_5.tmp_0_splitncnn_0 Add.3 -23330=4,3,160,160,24 0=24 1=3 4=1 5=1 6=5184 9=8 20=1 21=1 24=22 26=29503 28=17562 41=13 50=24349 51=32 46=-86 47=24290 48=14 -23323=1,1 -23333=1,1 -23331=2,5.733347,0.0 54=2
Concat                   Concat.0                 2 1 swish_4.tmp_0 Add.3 Concat.1 -23330=4,3,160,160,48 47=0 -23323=1,1 -23333=1,1 -23331=2,5.733347,0.0 54=1
Split                    splitncnn_2              1 2 Concat.1 Concat.1_splitncnn_0 Concat.1_splitncnn_1 -23330=8,3,160,160,48,3,160,160,48 -23323=1,1 -23333=1,1 -23331=4,5.733347,0.0,5.733347,0.0 54=1
Pooling                  ReduceMean.0             1 1 Concat.1_splitncnn_0 ReduceMean.1 -23330=4,1,48,1,1 0=1 1=160 4=1 21=24871 22=12 -23323=1,1 -23333=1,1 -23331=2,34.813099,0.0 54=1
Convolution              Conv.8                   1 1 ReduceMean.1 hardsigmoid_0.tmp_0 -23330=4,1,48,1,1 0=48 1=1 5=1 6=2304 9=9 -23310=4,2.120000e+02,2.996000e+04,0.000000e+00,1.270000e+02 24=23 25=8 28=16384 41=14 -23323=1,1 -23333=1,1 -23331=2,234.060333,0.0 54=1
BinaryOp                 Mul.8                    2 1 Concat.1_splitncnn_1 hardsigmoid_0.tmp_0 Mul.9 -23330=4,3,160,160,48 0=2 22=19020 26=19 -23323=1,1 -23333=1,1 -23331=2,48.682041,0.0 54=1
Convolution              Conv.9                   1 1 Mul.9 swish_8.tmp_0 -23330=4,3,160,160,64 0=64 1=1 5=1 6=3072 9=8 24=21 28=18529 41=28 46=-69 47=30275 48=14 -23323=1,1 -23333=1,1 -23331=2,26.043455,0.0 54=1
Convolution              Conv.10                  1 1 swish_8.tmp_0 swish_9.tmp_0 -23330=4,3,80,80,96 0=96 1=3 3=2 4=1 5=1 6=55296 9=8 24=23 28=18190 41=28 46=-43 47=24290 48=13 -23323=1,1 -23333=1,1 -23331=2,16.073374,0.0 54=1
Split                    splitncnn_3              1 2 swish_9.tmp_0 swish_9.tmp_0_splitncnn_0 swish_9.tmp_0_splitncnn_1 -23330=8,3,80,80,96,3,80,80,96 -23323=1,1 -23333=1,1 -23331=4,16.073374,0.0,16.073374,0.0 54=1
Convolution              Conv.11                  1 1 swish_9.tmp_0_splitncnn_0 swish_10.tmp_0 -23330=4,3,80,80,48 0=48 1=1 5=1 6=4608 9=8 24=21 28=21620 41=30 46=-26 47=20086 48=12 -23323=1,1 -23333=1,1 -23331=2,2.896705,0.0 54=1
Convolution              Conv.12                  1 1 swish_9.tmp_0_splitncnn_1 swish_11.tmp_0 -23330=4,3,80,80,48 0=48 1=1 5=1 6=4608 9=8 24=22 28=27031 41=27 36=1 46=-41 47=25475 48=13 -23323=1,1 -23333=1,1 -23331=2,45.270386,0.0 54=1
Split                    splitncnn_4              1 2 swish_11.tmp_0 swish_11.tmp_0_splitncnn_0 swish_11.tmp_0_splitncnn_1 -23330=8,3,80,80,48,3,80,80,48 -23323=1,1 -23333=1,1 -23331=4,45.270386,0.0,45.270386,0.0 54=1
Convolution              Conv.13                  1 1 swish_11.tmp_0_splitncnn_1 swish_12.tmp_0 -23330=4,3,80,80,48 0=48 1=3 4=1 5=1 6=20736 9=8 24=22 28=28764 41=29 36=1 46=-125 47=16712 48=14 -23323=1,1 -23333=1,1 -23331=2,36.630222,0.0 54=1
Convolution              Conv.14                  2 1 swish_12.tmp_0 swish_11.tmp_0_splitncnn_0 Add.9 -23330=4,3,80,80,48 0=48 1=3 4=1 5=1 6=20736 9=8 20=1 21=1 24=23 26=18135 28=17816 41=14 50=19026 51=29 36=1 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,29.094654,0.0 54=2
Split                    splitncnn_5              1 2 Add.9 Add.9_splitncnn_0 Add.9_splitncnn_1 -23330=8,3,80,80,48,3,80,80,48 -23323=1,1 -23333=1,1 -23331=4,29.094654,0.0,29.094654,0.0 54=1
Convolution              Conv.15                  1 1 Add.9_splitncnn_1 swish_14.tmp_0 -23330=4,3,80,80,48 0=48 1=3 4=1 5=1 6=20736 9=8 24=23 28=22441 41=29 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,31.786453,0.0 54=1
Convolution              Conv.16                  2 1 swish_14.tmp_0 Add.9_splitncnn_0 Add.13 -23330=4,3,80,80,48 0=48 1=3 4=1 5=1 6=20736 9=8 20=1 21=1 24=21 26=24230 28=29794 41=12 50=17648 51=32 46=-18 47=29013 48=12 -23323=1,1 -23333=1,1 -23331=2,2.896705,0.0 54=2
Concat                   Concat.2                 2 1 swish_10.tmp_0 Add.13 Concat.3 -23330=4,3,80,80,96 -23323=1,1 -23333=1,1 -23331=2,2.896705,0.0 54=1
Split                    splitncnn_6              1 2 Concat.3 Concat.3_splitncnn_0 Concat.3_splitncnn_1 -23330=8,3,80,80,96,3,80,80,96 -23323=1,1 -23333=1,1 -23331=4,2.896705,0.0,2.896705,0.0 54=1
Pooling                  ReduceMean.2             1 1 Concat.3_splitncnn_0 ReduceMean.3 -23330=4,1,96,1,1 0=1 1=80 4=1 21=22984 22=11 -23323=1,1 -23333=1,1 -23331=2,32.509277,0.0 54=1
Convolution              Conv.17                  1 1 ReduceMean.3 hardsigmoid_1.tmp_0 -23330=4,1,96,1,1 0=96 1=1 5=1 6=9216 9=9 -23310=4,2.690000e+02,2.892600e+04,0.000000e+00,1.270000e+02 24=23 25=8 28=16384 41=14 -23323=1,1 -23333=1,1 -23331=2,225.986252,0.0 54=1
BinaryOp                 Mul.18                   2 1 Concat.3_splitncnn_1 hardsigmoid_1.tmp_0 Mul.19 -23330=4,3,80,80,96 0=2 22=18763 26=18 -23323=1,1 -23333=1,1 -23331=2,46.853649,0.0 54=1
Convolution              Conv.18                  1 1 Mul.19 swish_16.tmp_0 -23330=4,3,80,80,128 0=128 1=1 5=1 6=12288 9=8 24=21 28=24101 41=29 46=-115 47=18165 48=14 -23323=1,1 -23333=1,1 -23331=2,28.208118,0.0 54=1
Split                    splitncnn_7              1 2 swish_16.tmp_0 swish_16.tmp_0_splitncnn_0 swish_16.tmp_0_splitncnn_1 -23330=8,3,80,80,128,3,80,80,128 -23323=1,1 -23333=1,1 -23331=4,28.208118,0.0,28.208118,0.0 54=1
Convolution              Conv.19                  1 1 swish_16.tmp_0_splitncnn_1 swish_17.tmp_0 -23330=4,3,40,40,192 0=192 1=3 3=2 4=1 5=1 6=221184 9=8 24=22 28=26247 41=29 36=1 46=-82 47=25475 48=14 -23323=1,1 -23333=1,1 -23331=2,21.942223,0.0 54=1
Split                    splitncnn_8              1 2 swish_17.tmp_0 swish_17.tmp_0_splitncnn_0 swish_17.tmp_0_splitncnn_1 -23330=8,3,40,40,192,3,40,40,192 -23323=1,1 -23333=1,1 -23331=4,21.942223,0.0,21.942223,0.0 54=1
Convolution              Conv.20                  1 1 swish_17.tmp_0_splitncnn_0 swish_18.tmp_0 -23330=4,3,40,40,96 0=96 1=1 5=1 6=18432 9=8 24=21 28=32650 41=30 46=-41 47=25475 48=13 -23323=1,1 -23333=1,1 -23331=2,6.846084,0.0 54=1
Convolution              Conv.21                  1 1 swish_17.tmp_0_splitncnn_1 swish_19.tmp_0 -23330=4,3,40,40,96 0=96 1=1 5=1 6=18432 9=8 24=22 28=22863 41=29 36=1 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,32.238289,0.0 54=1
Split                    splitncnn_9              1 2 swish_19.tmp_0 swish_19.tmp_0_splitncnn_0 swish_19.tmp_0_splitncnn_1 -23330=8,3,40,40,96,3,40,40,96 -23323=1,1 -23333=1,1 -23331=4,32.238289,0.0,32.238289,0.0 54=1
Convolution              Conv.22                  1 1 swish_19.tmp_0_splitncnn_1 swish_20.tmp_0 -23330=4,3,40,40,96 0=96 1=3 4=1 5=1 6=82944 9=8 24=22 28=22574 41=29 46=-103 47=20281 48=14 -23323=1,1 -23333=1,1 -23331=2,23.564156,0.0 54=1
Convolution              Conv.23                  2 1 swish_20.tmp_0 swish_19.tmp_0_splitncnn_0 Add.19 -23330=4,3,40,40,96 0=96 1=3 4=1 5=1 6=82944 9=8 20=1 21=1 24=21 26=28695 28=19025 41=13 50=25028 51=30 36=1 46=-73 47=28616 48=14 -23323=1,1 -23333=1,1 -23331=2,21.563114,0.0 54=2
Split                    splitncnn_10             1 2 Add.19 Add.19_splitncnn_0 Add.19_splitncnn_1 -23330=8,3,40,40,96,3,40,40,96 -23323=1,1 -23333=1,1 -23331=4,21.563114,0.0,21.563114,0.0 54=1
Convolution              Conv.24                  1 1 Add.19_splitncnn_1 swish_22.tmp_0 -23330=4,3,40,40,96 0=96 1=3 4=1 5=1 6=82944 9=8 24=23 28=27366 41=29 46=-112 47=18651 48=14 -23323=1,1 -23333=1,1 -23331=2,31.160862,0.0 54=1
Convolution              Conv.25                  2 1 swish_22.tmp_0 Add.19_splitncnn_0 Add.23 -23330=4,3,40,40,96 0=96 1=3 4=1 5=1 6=82944 9=8 20=1 21=1 24=21 26=30338 28=22064 41=13 50=22474 51=31 36=1 46=-44 47=23738 48=13 -23323=1,1 -23333=1,1 -23331=2,6.846084,0.0 54=2
Concat                   Concat.4                 2 1 swish_18.tmp_0 Add.23 Concat.5 -23330=4,3,40,40,192 -23323=1,1 -23333=1,1 -23331=2,6.846084,0.0 54=1
Split                    splitncnn_11             1 2 Concat.5 Concat.5_splitncnn_0 Concat.5_splitncnn_1 -23330=8,3,40,40,192,3,40,40,192 -23323=1,1 -23333=1,1 -23331=4,6.846084,0.0,6.846084,0.0 54=1
Pooling                  ReduceMean.4             1 1 Concat.5_splitncnn_0 ReduceMean.5 -23330=4,1,192,1,1 0=1 1=40 4=1 21=20050 22=12 -23323=1,1 -23333=1,1 -23331=2,33.512531,0.0 54=1
Convolution              Conv.26                  1 1 ReduceMean.5 hardsigmoid_2.tmp_0 -23330=4,1,192,1,1 0=192 1=1 5=1 6=36864 9=9 -23310=4,2.880000e+02,3.257700e+04,0.000000e+00,1.270000e+02 24=23 25=8 28=16384 41=14 -23323=1,1 -23333=1,1 -23331=2,254.504242,0.0 54=1
BinaryOp                 Mul.28                   2 1 Concat.5_splitncnn_1 hardsigmoid_2.tmp_0 Mul.29 -23330=4,3,40,40,192 0=2 22=20265 26=19 -23323=1,1 -23333=1,1 -23331=2,67.347939,0.0 54=1
Convolution              Conv.27                  1 1 Mul.29 swish_24.tmp_0 -23330=4,3,40,40,256 0=256 1=1 5=1 6=49152 9=8 24=22 28=24198 41=29 46=-118 47=17703 48=14 -23323=1,1 -23333=1,1 -23331=2,28.951174,0.0 54=1
Split                    splitncnn_12             1 2 swish_24.tmp_0 swish_24.tmp_0_splitncnn_0 swish_24.tmp_0_splitncnn_1 -23330=8,3,40,40,256,3,40,40,256 -23323=1,1 -23333=1,1 -23331=4,28.951174,0.0,28.951174,0.0 54=1
Convolution              Conv.28                  1 1 swish_24.tmp_0_splitncnn_1 swish_25.tmp_0 -23330=4,3,20,20,384 0=384 1=3 3=2 4=1 5=1 6=884736 9=8 24=23 28=27711 41=29 46=-111 47=18819 48=14 -23323=1,1 -23333=1,1 -23331=2,31.385065,0.0 54=1
Split                    splitncnn_13             1 2 swish_25.tmp_0 swish_25.tmp_0_splitncnn_0 swish_25.tmp_0_splitncnn_1 -23330=8,3,20,20,384,3,20,20,384 -23323=1,1 -23333=1,1 -23331=4,31.385065,0.0,31.385065,0.0 54=1
Convolution              Conv.29                  1 1 swish_25.tmp_0_splitncnn_0 swish_26.tmp_0 -23330=4,3,20,20,192 0=192 1=1 5=1 6=73728 9=8 24=22 28=17351 41=30 46=-67 47=31179 48=14 -23323=1,1 -23333=1,1 -23331=2,5.876057,0.0 54=1
Convolution              Conv.30                  1 1 swish_25.tmp_0_splitncnn_1 swish_27.tmp_0 -23330=4,3,20,20,192 0=192 1=1 5=1 6=73728 9=8 24=22 28=26709 41=29 36=1 46=-72 47=29013 48=14 -23323=1,1 -23333=1,1 -23331=2,19.524185,0.0 54=1
Split                    splitncnn_14             1 2 swish_27.tmp_0 swish_27.tmp_0_splitncnn_0 swish_27.tmp_0_splitncnn_1 -23330=8,3,20,20,192,3,20,20,192 -23323=1,1 -23333=1,1 -23331=4,19.524185,0.0,19.524185,0.0 54=1
Convolution              Conv.31                  1 1 swish_27.tmp_0_splitncnn_1 swish_28.tmp_0 -23330=4,3,20,20,192 0=192 1=3 4=1 5=1 6=331776 9=8 24=23 28=27931 41=29 36=1 46=-96 47=21760 48=14 -23323=1,1 -23333=1,1 -23331=2,27.158987,0.0 54=1
Convolution              Conv.32                  2 1 swish_28.tmp_0 swish_27.tmp_0_splitncnn_0 Add.29 -23330=4,3,20,20,192 0=192 1=3 4=1 5=1 6=331776 9=8 20=1 21=1 24=23 26=25686 28=19995 41=13 50=25162 51=31 36=1 46=-38 47=27486 48=13 -23323=1,1 -23333=1,1 -23331=2,5.876057,0.0 54=2
Concat                   Concat.6                 2 1 swish_26.tmp_0 Add.29 Concat.7 -23330=4,3,20,20,384 -23323=1,1 -23333=1,1 -23331=2,5.876057,0.0 54=1
Split                    splitncnn_15             1 2 Concat.7 Concat.7_splitncnn_0 Concat.7_splitncnn_1 -23330=8,3,20,20,384,3,20,20,384 -23323=1,1 -23333=1,1 -23331=4,5.876057,0.0,5.876057,0.0 54=1
Pooling                  ReduceMean.6             1 1 Concat.7_splitncnn_0 ReduceMean.7 -23330=4,1,384,1,1 0=1 1=20 4=1 21=31526 22=13 -23323=1,1 -23333=1,1 -23331=2,22.613045,0.0 54=1
Convolution              Conv.33                  1 1 ReduceMean.7 hardsigmoid_3.tmp_0 -23330=4,1,384,1,1 0=384 1=1 5=1 6=147456 9=9 -23310=4,3.050000e+02,2.535800e+04,0.000000e+00,1.270000e+02 24=23 25=8 28=16384 41=14 -23323=1,1 -23333=1,1 -23331=2,198.107208,0.0 54=1
BinaryOp                 Mul.36                   2 1 Concat.7_splitncnn_1 hardsigmoid_3.tmp_0 Mul.37 -23330=4,3,20,20,384 0=2 22=30581 26=20 -23323=1,1 -23333=1,1 -23331=2,33.949753,0.0 54=1
Convolution              Conv.34                  1 1 Mul.37 swish_30.tmp_0 -23330=4,3,20,20,512 0=512 1=1 5=1 6=196608 9=8 24=22 28=30030 41=29 46=-58 47=18008 48=13 -23323=1,1 -23333=1,1 -23331=2,17.630701,0.0 54=1
Split                    splitncnn_16             1 2 swish_30.tmp_0 swish_30.tmp_0_splitncnn_0 swish_30.tmp_0_splitncnn_1 -23330=8,3,20,20,512,3,20,20,512 -23323=1,1 -23333=1,1 -23331=4,17.630701,0.0,17.630701,0.0 54=1
Convolution              Conv.35                  1 1 swish_30.tmp_0_splitncnn_0 swish_31.tmp_0 -23330=4,3,20,20,192 0=192 1=1 5=1 6=98304 9=8 24=22 28=19649 41=29 46=-116 47=18008 48=14 -23323=1,1 -23333=1,1 -23331=2,23.172508,0.0 54=1
Convolution              Conv.36                  1 1 swish_30.tmp_0_splitncnn_1 swish_32.tmp_0 -23330=4,3,20,20,192 0=192 1=1 5=1 6=98304 9=8 24=21 28=16393 41=29 46=-107 47=19523 48=14 -23323=1,1 -23333=1,1 -23331=2,17.883638,0.0 54=1
Convolution              Conv.37                  1 1 swish_32.tmp_0 swish_33.tmp_0 -23330=4,3,20,20,192 0=192 1=3 4=1 5=1 6=331776 9=8 24=23 28=20429 41=29 36=1 46=-114 47=18324 48=14 -23323=1,1 -23333=1,1 -23331=2,23.694338,0.0 54=1
Convolution              Conv.38                  1 1 swish_33.tmp_0 swish_34.tmp_0 -23330=4,3,20,20,192 0=192 1=3 4=1 5=1 6=331776 9=8 24=23 28=32672 41=30 36=1 46=-109 47=19165 48=14 -23323=1,1 -23333=1,1 -23331=2,18.038742,0.0 54=1
Split                    splitncnn_17             1 2 swish_34.tmp_0 swish_34.tmp_0_splitncnn_0 swish_34.tmp_0_splitncnn_1 -23330=8,3,20,20,192,3,20,20,192 -23323=1,1 -23333=1,1 -23331=4,18.038742,0.0,18.038742,0.0 54=1
Pooling                  MaxPool.0                1 1 swish_34.tmp_0_splitncnn_0 pool2d_0.tmp_0 -23330=4,3,20,20,192 1=5 3=2 5=1 21=16384 22=14 -23323=1,1 -23333=1,1 -23331=2,18.038742,0.0 54=1
Split                    splitncnn_18             1 2 pool2d_0.tmp_0 pool2d_0.tmp_0_splitncnn_0 pool2d_0.tmp_0_splitncnn_1 -23330=8,3,20,20,192,3,20,20,192 -23323=1,1 -23333=1,1 -23331=4,18.038742,0.0,18.038742,0.0 54=1
Pooling                  MaxPool.1_s1             1 1 pool2d_0.tmp_0_splitncnn_0 pool2d_1.tmp_0 -23330=4,3,20,20,192 1=5 3=2 5=1 21=16384 22=14 -23323=1,1 -23333=1,1 -23331=2,18.038742,0.0 54=1
Split                    splitncnn_19             1 2 pool2d_1.tmp_0 pool2d_1.tmp_0_splitncnn_0 pool2d_1.tmp_0_splitncnn_1 -23330=8,3,20,20,192,3,20,20,192 -23323=1,1 -23333=1,1 -23331=4,18.038742,0.0,18.038742,0.0 54=1
Pooling                  MaxPool.2_s2             1 1 pool2d_1.tmp_0_splitncnn_0 pool2d_2.tmp_0 -23330=4,3,20,20,192 1=5 3=2 5=1 21=16384 22=14 -23323=1,1 -23333=1,1 -23331=2,18.038742,0.0 54=1
Concat                   Concat.8                 4 1 swish_34.tmp_0_splitncnn_1 pool2d_0.tmp_0_splitncnn_1 pool2d_1.tmp_0_splitncnn_1 pool2d_2.tmp_0 Concat.9 47=1 -23330=4,3,20,20,768 -23323=1,1 -23333=1,1 -23331=2,18.038742,0.0 54=1
Convolution              Conv.39                  1 1 Concat.9 swish_35.tmp_0 -23330=4,3,20,20,192 0=192 1=1 5=1 6=147456 9=8 24=22 28=28998 41=30 36=1 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,23.172508,0.0 54=1
Concat                   Concat.10                2 1 swish_31.tmp_0 swish_35.tmp_0 Concat.11 -23330=4,3,20,20,384 -23323=1,1 -23333=1,1 -23331=2,23.172508,0.0 54=1
Convolution              Conv.40                  1 1 Concat.11 swish_36.tmp_0 -23330=4,3,20,20,384 0=384 1=1 5=1 6=147456 9=8 24=21 28=24855 41=30 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,18.327740,0.0 54=1
Split                    splitncnn_20             1 2 swish_36.tmp_0 swish_36.tmp_0_splitncnn_0 swish_36.tmp_0_splitncnn_1 -23330=8,3,20,20,384,3,20,20,384 -23323=1,1 -23333=1,1 -23331=4,18.327740,0.0,18.327740,0.0 54=1
Convolution              Conv.41                  1 1 swish_36.tmp_0_splitncnn_1 swish_37.tmp_0 -23330=4,3,20,20,192 0=192 1=1 5=1 6=73728 9=8 24=21 28=16518 41=29 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,28.951174,0.0 54=1
Interp                   Resize.0                 1 1 swish_37.tmp_0 nearest_interp_v2_0.tmp_0 -23330=4,3,40,40,192 0=1 1=2.000000e+00 2=2.000000e+00 -23323=1,1 -23333=1,1 -23331=2,28.951174,0.0 54=1
Concat                   Concat.12                2 1 nearest_interp_v2_0.tmp_0 swish_24.tmp_0_splitncnn_0 Concat.13 -23330=4,3,40,40,448 -23323=1,1 -23333=1,1 -23331=2,28.951174,0.0 54=1
Split                    splitncnn_21             1 2 Concat.13 Concat.13_splitncnn_0 Concat.13_splitncnn_1 -23330=8,3,40,40,448,3,40,40,448 -23323=1,1 -23333=1,1 -23331=4,28.951174,0.0,28.951174,0.0 54=1
Convolution              Conv.42                  1 1 Concat.13_splitncnn_0 swish_38.tmp_0 -23330=4,3,40,40,96 0=96 1=1 5=1 6=43008 9=8 24=21 28=26000 41=30 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,19.275904,0.0 54=1
Convolution              Conv.43                  1 1 Concat.13_splitncnn_1 swish_39.tmp_0 -23330=4,3,40,40,96 0=96 1=1 5=1 6=43008 9=8 24=21 28=19005 41=29 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,27.609425,0.0 54=1
Convolution              Conv.44                  1 1 swish_39.tmp_0 swish_40.tmp_0 -23330=4,3,40,40,96 0=96 1=3 4=1 5=1 6=82944 9=8 24=22 28=18281 41=29 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,27.094181,0.0 54=1
Convolution              Conv.45                  1 1 swish_40.tmp_0 swish_41.tmp_0 -23330=4,3,40,40,96 0=96 1=3 4=1 5=1 6=82944 9=8 24=23 28=22290 41=29 46=-85 47=24576 48=14 -23323=1,1 -23333=1,1 -23331=2,19.275904,0.0 54=1
Concat                   Concat.14                2 1 swish_38.tmp_0 swish_41.tmp_0 Concat.15 -23330=4,3,40,40,192 -23323=1,1 -23333=1,1 -23331=2,19.275904,0.0 54=1
Convolution              Conv.46                  1 1 Concat.15 swish_42.tmp_0 -23330=4,3,40,40,192 0=192 1=1 5=1 6=36864 9=8 24=22 28=26988 41=30 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,20.837769,0.0 54=1
Split                    splitncnn_22             1 2 swish_42.tmp_0 swish_42.tmp_0_splitncnn_0 swish_42.tmp_0_splitncnn_1 -23330=8,3,40,40,192,3,40,40,192 -23323=1,1 -23333=1,1 -23331=4,20.837769,0.0,20.837769,0.0 54=1
Convolution              Conv.47                  1 1 swish_42.tmp_0_splitncnn_1 swish_43.tmp_0 -23330=4,3,40,40,96 0=96 1=1 5=1 6=18432 9=8 24=22 28=28661 41=30 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,28.208118,0.0 54=1
Interp                   Resize.1                 1 1 swish_43.tmp_0 nearest_interp_v2_1.tmp_0 -23330=4,3,80,80,96 0=1 1=2.000000e+00 2=2.000000e+00 -23323=1,1 -23333=1,1 -23331=2,28.208118,0.0 54=1
Concat                   Concat.16                2 1 nearest_interp_v2_1.tmp_0 swish_16.tmp_0_splitncnn_0 Concat.17 -23330=4,3,80,80,224 -23323=1,1 -23333=1,1 -23331=2,28.208118,0.0 54=1
Split                    splitncnn_23             1 2 Concat.17 Concat.17_splitncnn_0 Concat.17_splitncnn_1 -23330=8,3,80,80,224,3,80,80,224 -23323=1,1 -23333=1,1 -23331=4,28.208118,0.0,28.208118,0.0 54=1
Convolution              Conv.48                  1 1 Concat.17_splitncnn_0 swish_44.tmp_0 -23330=4,3,80,80,48 0=48 1=1 5=1 6=10752 9=8 24=21 28=21627 41=30 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,24.593462,0.0 54=1
Convolution              Conv.49                  1 1 Concat.17_splitncnn_1 swish_45.tmp_0 -23330=4,3,80,80,48 0=48 1=1 5=1 6=10752 9=8 24=21 28=26235 41=29 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,43.941746,0.0 54=1
Convolution              Conv.50                  1 1 swish_45.tmp_0 swish_46.tmp_0 -23330=4,3,80,80,48 0=48 1=3 4=1 5=1 6=20736 9=8 24=22 28=24863 41=29 36=1 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,43.090813,0.0 54=1
Convolution              Conv.51                  1 1 swish_46.tmp_0 swish_47.tmp_0 -23330=4,3,80,80,48 0=48 1=3 4=1 5=1 6=20736 9=8 24=22 28=17760 41=29 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,24.593462,0.0 54=1
Concat                   Concat.18                2 1 swish_44.tmp_0 swish_47.tmp_0 Concat.19 -23330=4,3,80,80,96 -23323=1,1 -23333=1,1 -23331=2,24.593462,0.0 54=1
Convolution              Conv.52                  1 1 Concat.19 swish_48.tmp_0 -23330=4,3,80,80,96 0=96 1=1 5=1 6=9216 9=8 24=21 28=16400 41=29 46=-104 47=20086 48=14 -23323=1,1 -23333=1,1 -23331=2,17.313856,0.0 54=1
Split                    splitncnn_24             1 5 swish_48.tmp_0 swish_48.tmp_0_splitncnn_0 swish_48.tmp_0_splitncnn_1 swish_48.tmp_0_splitncnn_2 swish_48.tmp_0_splitncnn_3 swish_48.tmp_0_splitncnn_4 -23330=20,3,80,80,96,3,80,80,96,3,80,80,96,3,80,80,96,3,80,80,96 -23323=1,1 -23333=1,1 -23331=10,17.313856,0.0,17.313856,0.0,17.313856,0.0,17.313856,0.0,17.313856,0.0 54=1
Pooling                  GlobalAveragePool.2      1 1 swish_48.tmp_0_splitncnn_0 pool2d_5.tmp_0 -23330=4,1,96,1,1 0=1 1=80 4=1 21=24586 22=13 -23323=1,1 -23333=1,1 -23331=2,51.963509,0.0 54=1
Convolution              Conv.53                  1 1 swish_48.tmp_0_splitncnn_4 swish_49.tmp_0 -23330=4,3,40,40,96 0=96 1=3 3=2 4=1 5=1 6=82944 9=8 24=22 28=32705 41=30 46=-125 47=16712 48=14 -23323=1,1 -23333=1,1 -23331=2,20.837769,0.0 54=1
Split                    splitncnn_25             1 2 pool2d_5.tmp_0 pool2d_5.tmp_0_splitncnn_0 pool2d_5.tmp_0_splitncnn_1 -23330=8,1,96,1,1,1,96,1,1 -23323=1,1 -23333=1,1 -23331=4,51.963509,0.0,51.963509,0.0 54=1
Convolution              Conv.79                  1 1 pool2d_5.tmp_0_splitncnn_0 sigmoid_6.tmp_0 -23330=4,1,96,1,1 0=96 1=1 5=1 6=9216 9=4 24=24 28=26038 41=22 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,203.415192,0.0 54=1
Convolution              Conv.82                  1 1 pool2d_5.tmp_0_splitncnn_1 sigmoid_7.tmp_0 -23330=4,1,96,1,1 0=96 1=1 5=1 6=9216 9=4 24=25 28=24708 41=22 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,193.027313,0.0 54=1
Concat                   Concat.20                2 1 swish_49.tmp_0 swish_42.tmp_0_splitncnn_0 Concat.21 -23330=4,3,40,40,288 -23323=1,1 -23333=1,1 -23331=2,20.837769,0.0 54=1
Split                    splitncnn_26             1 2 Concat.21 Concat.21_splitncnn_0 Concat.21_splitncnn_1 -23330=8,3,40,40,288,3,40,40,288 -23323=1,1 -23333=1,1 -23331=4,20.837769,0.0,20.837769,0.0 54=1
BinaryOp                 Mul.81                   2 1 swish_48.tmp_0_splitncnn_1 sigmoid_6.tmp_0 Mul.82 -23330=4,3,80,80,96 0=2 22=25237 26=21 -23323=1,1 -23333=1,1 -23331=2,42.383121,0.0 54=1
BinaryOp                 Mul.84                   2 1 swish_48.tmp_0_splitncnn_2 sigmoid_7.tmp_0 Mul.85 -23330=4,3,80,80,96 0=2 22=27602 26=21 -23323=1,1 -23333=1,1 -23331=2,43.986958,0.0 54=1
Convolution              Conv.54                  1 1 Concat.21_splitncnn_0 swish_50.tmp_0 -23330=4,3,40,40,96 0=96 1=1 5=1 6=27648 9=8 24=21 28=23255 41=30 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,17.614851,0.0 54=1
Convolution              Conv.55                  1 1 Concat.21_splitncnn_1 swish_51.tmp_0 -23330=4,3,40,40,96 0=96 1=1 5=1 6=27648 9=8 24=22 28=16415 41=29 46=-123 47=16983 48=14 -23323=1,1 -23333=1,1 -23331=2,20.577677,0.0 54=1
Convolution              Conv.83                  1 1 Mul.85 swish_66.tmp_0 -23330=4,3,80,80,96 0=96 1=1 5=1 6=9216 9=8 24=21 28=16387 41=29 46=-80 47=26112 48=14 -23323=1,1 -23333=1,1 -23331=2,13.314038,0.0 54=1
Convolution              Conv.56                  1 1 swish_51.tmp_0 swish_52.tmp_0 -23330=4,3,40,40,96 0=96 1=3 4=1 5=1 6=82944 9=8 24=22 28=21927 41=29 46=-124 47=16846 48=14 -23323=1,1 -23333=1,1 -23331=2,27.769314,0.0 54=1
Convolution              Conv.80                  2 1 Mul.82 swish_48.tmp_0_splitncnn_3 Add.65 -23330=4,3,80,80,96 0=96 1=1 5=1 6=9216 9=8 20=1 21=1 24=20 26=20391 28=17760 41=15 50=19922 51=29 46=-119 47=17554 48=14 -23323=1,1 -23333=1,1 -23331=2,13.100578,0.0 54=2
Convolution              Conv.84                  1 1 swish_66.tmp_0 conv2d_84.tmp_0 -23330=4,3,80,80,68 0=68 1=3 4=1 5=1 6=58752 24=23 -23323=1,1 -23333=1,1 -23331=2,16.163479,0.0 54=1
Convolution              Conv.81                  1 1 Add.65 conv2d_81.tmp_0 -23330=4,3,80,80,5 0=5 1=3 4=1 5=1 6=4320 24=26 -23323=1,1 -23333=1,1 -23331=2,10.448325,0.0 54=1
Convolution              Conv.57                  1 1 swish_52.tmp_0 swish_53.tmp_0 -23330=4,3,40,40,96 0=96 1=3 4=1 5=1 6=82944 9=8 24=22 28=32679 41=30 46=-106 47=19707 48=14 -23323=1,1 -23333=1,1 -23331=2,17.614851,0.0 54=1
Concat                   Concat.22                2 1 swish_50.tmp_0 swish_53.tmp_0 Concat.23 -23330=4,3,40,40,192 -23323=1,1 -23333=1,1 -23331=2,17.614851,0.0 54=1
Convolution              Conv.58                  1 1 Concat.23 swish_54.tmp_0 -23330=4,3,40,40,192 0=192 1=1 5=1 6=36864 9=8 24=21 28=16407 41=29 46=-115 47=18165 48=14 -23323=1,1 -23333=1,1 -23331=2,19.258760,0.0 54=1
Split                    splitncnn_27             1 5 swish_54.tmp_0 swish_54.tmp_0_splitncnn_0 swish_54.tmp_0_splitncnn_1 swish_54.tmp_0_splitncnn_2 swish_54.tmp_0_splitncnn_3 swish_54.tmp_0_splitncnn_4 -23330=20,3,40,40,192,3,40,40,192,3,40,40,192,3,40,40,192,3,40,40,192 -23323=1,1 -23333=1,1 -23331=10,19.258760,0.0,19.258760,0.0,19.258760,0.0,19.258760,0.0,19.258760,0.0 54=1
Pooling                  GlobalAveragePool.1      1 1 swish_54.tmp_0_splitncnn_0 pool2d_4.tmp_0 -23330=4,1,192,1,1 0=1 1=40 4=1 21=25691 22=13 -23323=1,1 -23333=1,1 -23331=2,60.398376,0.0 54=1
Convolution              Conv.59                  1 1 swish_54.tmp_0_splitncnn_4 swish_55.tmp_0 -23330=4,3,20,20,192 0=192 1=3 3=2 4=1 5=1 6=331776 9=8 24=23 28=32670 41=30 46=-110 47=18991 48=14 -23323=1,1 -23333=1,1 -23331=2,18.327740,0.0 54=1
Split                    splitncnn_28             1 2 pool2d_4.tmp_0 pool2d_4.tmp_0_splitncnn_0 pool2d_4.tmp_0_splitncnn_1 -23330=8,1,192,1,1,1,192,1,1 -23323=1,1 -23333=1,1 -23331=4,60.398376,0.0,60.398376,0.0 54=1
Convolution              Conv.72                  1 1 pool2d_4.tmp_0_splitncnn_0 sigmoid_3.tmp_0 -23330=4,1,192,1,1 0=192 1=1 5=1 6=36864 9=4 24=24 28=27018 41=22 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,211.073364,0.0 54=1
Convolution              Conv.75                  1 1 pool2d_4.tmp_0_splitncnn_1 sigmoid_4.tmp_0 -23330=4,1,192,1,1 0=192 1=1 5=1 6=36864 9=4 24=25 28=27488 41=22 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,214.741241,0.0 54=1
Concat                   Concat.24                2 1 swish_55.tmp_0 swish_36.tmp_0_splitncnn_0 Concat.25 -23330=4,3,20,20,576 -23323=1,1 -23333=1,1 -23331=2,18.327740,0.0 54=1
Split                    splitncnn_29             1 2 Concat.25 Concat.25_splitncnn_0 Concat.25_splitncnn_1 -23330=8,3,20,20,576,3,20,20,576 -23323=1,1 -23333=1,1 -23331=4,18.327740,0.0,18.327740,0.0 54=1
BinaryOp                 Mul.75                   2 1 swish_54.tmp_0_splitncnn_1 sigmoid_3.tmp_0 Mul.76 -23330=4,3,40,40,192 0=2 22=20433 26=21 -23323=1,1 -23333=1,1 -23331=2,39.605816,0.0 54=1
BinaryOp                 Mul.78                   2 1 swish_54.tmp_0_splitncnn_2 sigmoid_4.tmp_0 Mul.79 -23330=4,3,40,40,192 0=2 22=19207 26=21 -23323=1,1 -23333=1,1 -23331=2,37.876411,0.0 54=1
Convolution              Conv.60                  1 1 Concat.25_splitncnn_0 swish_56.tmp_0 -23330=4,3,20,20,192 0=192 1=1 5=1 6=110592 9=8 24=22 28=23747 41=30 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,15.370236,0.0 54=1
Convolution              Conv.61                  1 1 Concat.25_splitncnn_1 swish_57.tmp_0 -23330=4,3,20,20,192 0=192 1=1 5=1 6=110592 9=8 24=21 28=16397 41=29 46=-106 47=19707 48=14 -23323=1,1 -23333=1,1 -23331=2,17.742382,0.0 54=1
Convolution              Conv.76                  1 1 Mul.79 swish_64.tmp_0 -23330=4,3,40,40,192 0=192 1=1 5=1 6=36864 9=8 24=21 28=32761 41=30 46=-90 47=23211 48=14 -23323=1,1 -23333=1,1 -23331=2,14.923519,0.0 54=1
Convolution              Conv.62                  1 1 swish_57.tmp_0 swish_58.tmp_0 -23330=4,3,20,20,192 0=192 1=3 4=1 5=1 6=331776 9=8 24=22 28=20441 41=29 36=1 46=-105 47=19895 48=14 -23323=1,1 -23333=1,1 -23331=2,21.864054,0.0 54=1
Convolution              Conv.73                  2 1 Mul.76 swish_54.tmp_0_splitncnn_3 Add.55 -23330=4,3,40,40,192 0=192 1=1 5=1 6=36864 9=8 20=1 21=1 24=21 26=19461 28=19750 41=15 50=21557 51=29 46=-114 47=18324 48=14 -23323=1,1 -23333=1,1 -23331=2,15.048635,0.0 54=2
Convolution              Conv.77                  1 1 swish_64.tmp_0 conv2d_77.tmp_0 -23330=4,3,40,40,68 0=68 1=3 4=1 5=1 6=117504 24=24 -23323=1,1 -23333=1,1 -23331=2,14.689328,0.0 54=1
Convolution              Conv.74                  1 1 Add.55 conv2d_74.tmp_0 -23330=4,3,40,40,5 0=5 1=3 4=1 5=1 6=8640 24=26 -23323=1,1 -23333=1,1 -23331=2,11.275107,0.0 54=1
Convolution              Conv.63                  1 1 swish_58.tmp_0 swish_59.tmp_0 -23330=4,3,20,20,192 0=192 1=3 4=1 5=1 6=331776 9=8 24=22 28=16818 41=29 46=-90 47=23211 48=14 -23323=1,1 -23333=1,1 -23331=2,15.370236,0.0 54=1
Concat                   Concat.26                2 1 swish_56.tmp_0 swish_59.tmp_0 Concat.27 -23330=4,3,20,20,384 -23323=1,1 -23333=1,1 -23331=2,15.370236,0.0 54=1
Convolution              Conv.64                  1 1 Concat.27 swish_60.tmp_0 -23330=4,3,20,20,384 0=384 1=1 5=1 6=147456 9=8 24=21 28=19954 41=29 46=-106 47=19707 48=14 -23323=1,1 -23333=1,1 -23331=2,21.486801,0.0 54=1
Split                    splitncnn_30             1 4 swish_60.tmp_0 swish_60.tmp_0_splitncnn_0 swish_60.tmp_0_splitncnn_1 swish_60.tmp_0_splitncnn_2 swish_60.tmp_0_splitncnn_3 -23330=16,3,20,20,384,3,20,20,384,3,20,20,384,3,20,20,384 -23323=1,1 -23333=1,1 -23331=8,21.486801,0.0,21.486801,0.0,21.486801,0.0,21.486801,0.0 54=1
Pooling                  GlobalAveragePool.0      1 1 swish_60.tmp_0_splitncnn_0 pool2d_3.tmp_0 -23330=4,1,384,1,1 0=1 1=20 4=1 21=26973 22=13 -23323=1,1 -23333=1,1 -23331=2,70.747498,0.0 54=1
Split                    splitncnn_31             1 2 pool2d_3.tmp_0 pool2d_3.tmp_0_splitncnn_0 pool2d_3.tmp_0_splitncnn_1 -23330=8,1,384,1,1,1,384,1,1 -23323=1,1 -23333=1,1 -23331=4,70.747498,0.0,70.747498,0.0 54=1
Convolution              Conv.65                  1 1 pool2d_3.tmp_0_splitncnn_0 sigmoid_0.tmp_0 -23330=4,1,384,1,1 0=384 1=1 5=1 6=147456 9=4 24=24 28=27203 41=22 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,212.515762,0.0 54=1
Convolution              Conv.68                  1 1 pool2d_3.tmp_0_splitncnn_1 sigmoid_1.tmp_0 -23330=4,1,384,1,1 0=384 1=1 5=1 6=147456 9=4 24=26 28=28192 41=22 46=-127 47=16449 48=14 -23323=1,1 -23333=1,1 -23331=2,220.242783,0.0 54=1
BinaryOp                 Mul.69                   2 1 swish_60.tmp_0_splitncnn_1 sigmoid_0.tmp_0 Mul.70 -23330=4,3,20,20,384 0=2 22=19375 26=21 -23323=1,1 -23333=1,1 -23331=2,42.186268,0.0 54=1
BinaryOp                 Mul.72                   2 1 swish_60.tmp_0_splitncnn_2 sigmoid_1.tmp_0 Mul.73 -23330=4,3,20,20,384 0=2 22=18660 26=21 -23323=1,1 -23333=1,1 -23331=2,42.106567,0.0 54=1
Convolution              Conv.69                  1 1 Mul.73 swish_62.tmp_0 -23330=4,3,20,20,384 0=384 1=1 5=1 6=147456 9=8 24=21 28=32765 41=30 46=-81 47=25790 48=14 -23323=1,1 -23333=1,1 -23331=2,13.567829,0.0 54=1
Convolution              Conv.66                  2 1 Mul.70 swish_60.tmp_0_splitncnn_3 Add.45 -23330=4,3,20,20,384 0=384 1=1 5=1 6=147456 9=8 20=1 21=1 24=21 26=19728 28=22045 41=15 50=19937 51=29 36=1 46=-115 47=18165 48=14 -23323=1,1 -23333=1,1 -23331=2,15.741484,0.0 54=2
Convolution              Conv.70                  1 1 swish_62.tmp_0 conv2d_70.tmp_0 -23330=4,3,20,20,68 0=68 1=3 4=1 5=1 6=235008 24=25 -23323=1,1 -23333=1,1 -23331=2,11.536797,0.0 54=1
Convolution              Conv.67                  1 1 Add.45 conv2d_67.tmp_0 -23330=4,3,20,20,5 0=5 1=3 4=1 5=1 6=17280 24=27 -23323=1,1 -23333=1,1 -23331=2,10.197723,0.0 54=1
