7767517
218 258
Input                    in0                      0 1 in0
MemoryData               mean                     0 1 1 0=1 1=1 2=3
MemoryData               std                      0 1 2 0=1 1=1 2=3
BinaryOp                 sub_0                    2 1 in0 1 3 0=1
BinaryOp                 div_1                    2 1 3 2 4 0=3
Convolution              convrelu_0               1 1 4 5 0=24 1=3 -23310=1,0.1 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=648 9=2
Pooling                  maxpool2d_73             1 1 5 6 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Split                    splitncnn_0              1 2 6 7 8
ConvolutionDepthWise     convdw_166               1 1 8 9 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216 7=24
Convolution              convrelu_1               1 1 9 10 0=58 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1392 9=2
Convolution              convrelu_2               1 1 7 11 0=58 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1392 9=2
ConvolutionDepthWise     convdw_167               1 1 11 12 0=58 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=522 7=58
Convolution              convrelu_3               1 1 12 13 0=58 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3364 9=2
Concat                   cat_0                    2 1 10 13 14 0=0
ShuffleChannel           channelshuffle_78        1 1 14 15 0=2 1=0
Slice                    tensor_split_0           1 2 15 16 17 -23300=2,58,-233 1=0
Convolution              convrelu_4               1 1 17 18 0=58 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3364 9=2
ConvolutionDepthWise     convdw_168               1 1 18 19 0=58 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=522 7=58
Convolution              convrelu_5               1 1 19 20 0=58 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3364 9=2
Concat                   cat_1                    2 1 16 20 21 0=0
ShuffleChannel           channelshuffle_79        1 1 21 22 0=2 1=0
Slice                    tensor_split_1           1 2 22 23 24 -23300=2,58,-233 1=0
Convolution              convrelu_6               1 1 24 25 0=58 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3364 9=2
ConvolutionDepthWise     convdw_169               1 1 25 26 0=58 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=522 7=58
Convolution              convrelu_7               1 1 26 27 0=58 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3364 9=2
Concat                   cat_2                    2 1 23 27 28 0=0
ShuffleChannel           channelshuffle_80        1 1 28 29 0=2 1=0
Slice                    tensor_split_2           1 2 29 30 31 -23300=2,58,-233 1=0
Convolution              convrelu_8               1 1 31 32 0=58 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3364 9=2
ConvolutionDepthWise     convdw_170               1 1 32 33 0=58 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=522 7=58
Convolution              convrelu_9               1 1 33 34 0=58 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3364 9=2
Concat                   cat_3                    2 1 30 34 35 0=0
ShuffleChannel           channelshuffle_81        1 1 35 36 0=2 1=0
Split                    splitncnn_1              1 3 36 37 38 39
ConvolutionDepthWise     convdw_171               1 1 39 40 0=116 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1044 7=116
Convolution              convrelu_10              1 1 40 41 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
Convolution              convrelu_11              1 1 38 42 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
ConvolutionDepthWise     convdw_172               1 1 42 43 0=116 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1044 7=116
Convolution              convrelu_12              1 1 43 44 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
Concat                   cat_4                    2 1 41 44 45 0=0
ShuffleChannel           channelshuffle_82        1 1 45 46 0=2 1=0
Slice                    tensor_split_3           1 2 46 47 48 -23300=2,116,-233 1=0
Convolution              convrelu_13              1 1 48 49 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
ConvolutionDepthWise     convdw_173               1 1 49 50 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_14              1 1 50 51 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
Concat                   cat_5                    2 1 47 51 52 0=0
ShuffleChannel           channelshuffle_83        1 1 52 53 0=2 1=0
Slice                    tensor_split_4           1 2 53 54 55 -23300=2,116,-233 1=0
Convolution              convrelu_15              1 1 55 56 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
ConvolutionDepthWise     convdw_174               1 1 56 57 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_16              1 1 57 58 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
Concat                   cat_6                    2 1 54 58 59 0=0
ShuffleChannel           channelshuffle_84        1 1 59 60 0=2 1=0
Slice                    tensor_split_5           1 2 60 61 62 -23300=2,116,-233 1=0
Convolution              convrelu_17              1 1 62 63 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
ConvolutionDepthWise     convdw_175               1 1 63 64 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_18              1 1 64 65 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
Concat                   cat_7                    2 1 61 65 66 0=0
ShuffleChannel           channelshuffle_85        1 1 66 67 0=2 1=0
Slice                    tensor_split_6           1 2 67 68 69 -23300=2,116,-233 1=0
Convolution              convrelu_19              1 1 69 70 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
ConvolutionDepthWise     convdw_176               1 1 70 71 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_20              1 1 71 72 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
Concat                   cat_8                    2 1 68 72 73 0=0
ShuffleChannel           channelshuffle_86        1 1 73 74 0=2 1=0
Slice                    tensor_split_7           1 2 74 75 76 -23300=2,116,-233 1=0
Convolution              convrelu_21              1 1 76 77 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
ConvolutionDepthWise     convdw_177               1 1 77 78 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_22              1 1 78 79 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
Concat                   cat_9                    2 1 75 79 80 0=0
ShuffleChannel           channelshuffle_87        1 1 80 81 0=2 1=0
Slice                    tensor_split_8           1 2 81 82 83 -23300=2,116,-233 1=0
Convolution              convrelu_23              1 1 83 84 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
ConvolutionDepthWise     convdw_178               1 1 84 85 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_24              1 1 85 86 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
Concat                   cat_10                   2 1 82 86 87 0=0
ShuffleChannel           channelshuffle_88        1 1 87 88 0=2 1=0
Slice                    tensor_split_9           1 2 88 89 90 -23300=2,116,-233 1=0
Convolution              convrelu_25              1 1 90 91 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
ConvolutionDepthWise     convdw_179               1 1 91 92 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_26              1 1 92 93 0=116 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=2
Concat                   cat_11                   2 1 89 93 94 0=0
ShuffleChannel           channelshuffle_89        1 1 94 95 0=2 1=0
Split                    splitncnn_2              1 3 95 96 97 98
ConvolutionDepthWise     convdw_180               1 1 98 99 0=232 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2088 7=232
Convolution              convrelu_27              1 1 99 100 0=232 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=2
Convolution              convrelu_28              1 1 97 101 0=232 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=2
ConvolutionDepthWise     convdw_181               1 1 101 102 0=232 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2088 7=232
Convolution              convrelu_29              1 1 102 103 0=232 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=2
Concat                   cat_12                   2 1 100 103 104 0=0
ShuffleChannel           channelshuffle_90        1 1 104 105 0=2 1=0
Slice                    tensor_split_10          1 2 105 106 107 -23300=2,232,-233 1=0
Convolution              convrelu_30              1 1 107 108 0=232 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=2
ConvolutionDepthWise     convdw_182               1 1 108 109 0=232 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2088 7=232
Convolution              convrelu_31              1 1 109 110 0=232 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=2
Concat                   cat_13                   2 1 106 110 111 0=0
ShuffleChannel           channelshuffle_91        1 1 111 112 0=2 1=0
Slice                    tensor_split_11          1 2 112 113 114 -23300=2,232,-233 1=0
Convolution              convrelu_32              1 1 114 115 0=232 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=2
ConvolutionDepthWise     convdw_183               1 1 115 116 0=232 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2088 7=232
Convolution              convrelu_33              1 1 116 117 0=232 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=2
Concat                   cat_14                   2 1 113 117 118 0=0
ShuffleChannel           channelshuffle_92        1 1 118 119 0=2 1=0
Slice                    tensor_split_12          1 2 119 120 121 -23300=2,232,-233 1=0
Convolution              convrelu_34              1 1 121 122 0=232 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=2
ConvolutionDepthWise     convdw_184               1 1 122 123 0=232 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2088 7=232
Convolution              convrelu_35              1 1 123 124 0=232 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=2
Concat                   cat_15                   2 1 120 124 125 0=0
ShuffleChannel           channelshuffle_93        1 1 125 126 0=2 1=0
Convolution              convrelu_36              1 1 37 127 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=11136 9=2
Convolution              convrelu_37              1 1 96 128 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=22272 9=2
Convolution              convrelu_38              1 1 126 129 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=44544 9=2
Split                    splitncnn_3              1 3 129 130 131 132
Interp                   interpolate_0            1 1 131 133 0=2 1=2.0 2=2.0 6=0
Concat                   cat_16                   2 1 133 128 134 0=0
Split                    splitncnn_4              1 2 134 135 136
Convolution              convrelu_39              1 1 135 137 0=48 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
Split                    splitncnn_5              1 2 137 138 139
ConvolutionDepthWise     convdwrelu_0             1 1 139 140 0=48 1=3 -23310=1,0.1 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48 9=2
Concat                   cat_17                   2 1 138 140 141 0=0
Convolution              conv_134                 1 1 141 142 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Split                    splitncnn_6              1 2 142 143 144
ConvolutionDepthWise     convdw_186               1 1 144 145 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Concat                   cat_18                   2 1 143 145 146 0=0
ConvolutionDepthWise     convdw_187               1 1 136 147 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192
Convolution              conv_135                 1 1 147 148 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
BinaryOp                 add_2                    2 1 146 148 149 0=0
Split                    splitncnn_7              1 2 149 150 151
Interp                   interpolate_1            1 1 151 152 0=2 1=2.0 2=2.0 6=0
Concat                   cat_19                   2 1 152 127 153 0=0
Split                    splitncnn_8              1 2 153 154 155
Convolution              convrelu_40              1 1 154 156 0=48 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
Split                    splitncnn_9              1 2 156 157 158
ConvolutionDepthWise     convdwrelu_1             1 1 158 159 0=48 1=3 -23310=1,0.1 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48 9=2
Concat                   cat_20                   2 1 157 159 160 0=0
Convolution              conv_137                 1 1 160 161 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Split                    splitncnn_10             1 2 161 162 163
ConvolutionDepthWise     convdw_189               1 1 163 164 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Concat                   cat_21                   2 1 162 164 165 0=0
ConvolutionDepthWise     convdw_190               1 1 155 166 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192
Convolution              conv_138                 1 1 166 167 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
BinaryOp                 add_3                    2 1 165 167 168 0=0
Split                    splitncnn_11             1 2 168 169 170
ConvolutionDepthWise     convdwrelu_2             1 1 170 171 0=96 1=5 -23310=1,0.1 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96 9=2
Convolution              convrelu_41              1 1 171 172 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
Concat                   cat_22                   2 1 172 150 173 0=0
Split                    splitncnn_12             1 2 173 174 175
Convolution              convrelu_42              1 1 174 176 0=48 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
Split                    splitncnn_13             1 2 176 177 178
ConvolutionDepthWise     convdwrelu_3             1 1 178 179 0=48 1=3 -23310=1,0.1 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48 9=2
Concat                   cat_23                   2 1 177 179 180 0=0
Convolution              conv_141                 1 1 180 181 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Split                    splitncnn_14             1 2 181 182 183
ConvolutionDepthWise     convdw_193               1 1 183 184 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Concat                   cat_24                   2 1 182 184 185 0=0
ConvolutionDepthWise     convdw_194               1 1 175 186 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192
Convolution              conv_142                 1 1 186 187 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
BinaryOp                 add_4                    2 1 185 187 188 0=0
Split                    splitncnn_15             1 2 188 189 190
ConvolutionDepthWise     convdwrelu_4             1 1 190 191 0=96 1=5 -23310=1,0.1 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96 9=2
Convolution              convrelu_43              1 1 191 192 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
Concat                   cat_25                   2 1 192 130 193 0=0
Split                    splitncnn_16             1 2 193 194 195
Convolution              convrelu_44              1 1 194 196 0=48 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
Split                    splitncnn_17             1 2 196 197 198
ConvolutionDepthWise     convdwrelu_5             1 1 198 199 0=48 1=3 -23310=1,0.1 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48 9=2
Concat                   cat_26                   2 1 197 199 200 0=0
Convolution              conv_145                 1 1 200 201 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Split                    splitncnn_18             1 2 201 202 203
ConvolutionDepthWise     convdw_197               1 1 203 204 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Concat                   cat_27                   2 1 202 204 205 0=0
ConvolutionDepthWise     convdw_198               1 1 195 206 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192
Convolution              conv_146                 1 1 206 207 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
BinaryOp                 add_5                    2 1 205 207 208 0=0
Split                    splitncnn_19             1 2 208 209 210
ConvolutionDepthWise     convdwrelu_6             1 1 132 211 0=96 1=5 -23310=1,0.1 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96 9=2
Convolution              convrelu_45              1 1 211 212 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
ConvolutionDepthWise     convdwrelu_7             1 1 210 213 0=96 1=5 -23310=1,0.1 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96 9=2
Convolution              convrelu_46              1 1 213 214 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
BinaryOp                 add_6                    2 1 212 214 215 0=0
ConvolutionDepthWise     convdwrelu_8             1 1 169 216 0=96 1=5 -23310=1,0.1 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=2
Convolution              convrelu_47              1 1 216 217 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
ConvolutionDepthWise     convdwrelu_9             1 1 217 218 0=96 1=5 -23310=1,0.1 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=2
Convolution              convrelu_48              1 1 218 219 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
Convolution              conv_151                 1 1 219 220 0=37 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3552
Slice                    split_0                  1 2 220 221 222 -23300=2,5,32 1=0
Sigmoid                  sigmoid_74               1 1 221 223
Concat                   cat_28                   2 1 223 222 224 0=0
Reshape                  reshape_162              1 1 224 225 0=2704 1=37
ConvolutionDepthWise     convdwrelu_10            1 1 189 226 0=96 1=5 -23310=1,0.1 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=2
Convolution              convrelu_49              1 1 226 227 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
ConvolutionDepthWise     convdwrelu_11            1 1 227 228 0=96 1=5 -23310=1,0.1 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=2
Convolution              convrelu_50              1 1 228 229 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
Convolution              conv_154                 1 1 229 230 0=37 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3552
Slice                    split_1                  1 2 230 231 232 -23300=2,5,32 1=0
Sigmoid                  sigmoid_75               1 1 231 233
Concat                   cat_29                   2 1 233 232 234 0=0
Reshape                  reshape_163              1 1 234 235 0=676 1=37
ConvolutionDepthWise     convdwrelu_12            1 1 209 236 0=96 1=5 -23310=1,0.1 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=2
Convolution              convrelu_51              1 1 236 237 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
ConvolutionDepthWise     convdwrelu_13            1 1 237 238 0=96 1=5 -23310=1,0.1 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=2
Convolution              convrelu_52              1 1 238 239 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
Convolution              conv_157                 1 1 239 240 0=37 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3552
Slice                    split_2                  1 2 240 241 242 -23300=2,5,32 1=0
Sigmoid                  sigmoid_76               1 1 241 243
Concat                   cat_30                   2 1 243 242 244 0=0
Reshape                  reshape_164              1 1 244 245 0=169 1=37
ConvolutionDepthWise     convdwrelu_14            1 1 215 246 0=96 1=5 -23310=1,0.1 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=2
Convolution              convrelu_53              1 1 246 247 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
ConvolutionDepthWise     convdwrelu_15            1 1 247 248 0=96 1=5 -23310=1,0.1 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=2
Convolution              convrelu_54              1 1 248 249 0=96 1=1 -23310=1,0.1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=2
Convolution              conv_160                 1 1 249 250 0=37 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3552
Slice                    split_3                  1 2 250 251 252 -23300=2,5,32 1=0
Sigmoid                  sigmoid_77               1 1 251 253
Concat                   cat_31                   2 1 253 252 254 0=0
Reshape                  reshape_165              1 1 254 255 0=49 1=37
Concat                   cat_32                   4 1 225 235 245 255 256 0=1
Permute                  permute_161              1 1 256 out0 0=1
